michelesponchiado/CC2650_fw_update/src/sblAppEx.cpp
	// check if valid
	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		if (fileCrc != p_header->firmware_body_CRC32_CC2650)
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_invalid_body_CRC;
			syslog(LOG_ERR, "header has invalid body CRC; header has %u, calculated is %u", p_header->firmware_body_CRC32_CC2650, fileCrc);
		}
	}
	if (p_dst_header)
	{
		memset(p_dst_header, 0, sizeof(*p_dst_header));
		if (r == enum_do_CC2650_fw_update_retcode_OK)
		{
			memcpy(p_dst_header, p_header, sizeof(*p_dst_header));
		}
	}

	if (do_fw_update)
	{

		if (r == enum_do_CC2650_fw_update_retcode_OK)
		{

			//
			// Erasing as much flash needed to program firmware.
			//
			syslog(LOG_INFO, "erasing the flash...");
			if(pDevice->eraseFlashRange(devFlashBase, body_size) != SBL_SUCCESS)
			{
				r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_erase_the_flash;
				syslog(LOG_ERR, "erasing the flash something went wrong");
			}
		}

		if (r == enum_do_CC2650_fw_update_retcode_OK)
		{
			//
			// Writing file to device flash memory.
			//
			syslog(LOG_INFO, "writing the flash...");
			if(pDevice->writeFlashRange(devFlashBase, body_size, (const char *)p_firmware_body) != SBL_SUCCESS)
			{
				r = enum_do_CC2650_fw_update_retcode_ERR_writing_flash;
				syslog(LOG_ERR, "writing the flash something went wrong");
			}
		}
	
		if (r == enum_do_CC2650_fw_update_retcode_OK)
		{
			//
			// Calculate CRC checksum of flashed content.
			//
			syslog(LOG_INFO, "Calculating the CRC...");
			if(pDevice->calculateCrc32(devFlashBase, body_size, &devCrc) != SBL_SUCCESS)
			{
				r = enum_do_CC2650_fw_update_retcode_ERR_CRC_calculating_gone_bad;
				syslog(LOG_ERR, "Calculating the CRC something went wrong");

			}
		}

		if (r == enum_do_CC2650_fw_update_retcode_OK)
		{
			//
			// Compare CRC checksums
			//
			if(fileCrc == devCrc)
			{
				syslog(LOG_INFO, "The CRC compares OK");
			}
			else
			{
				r = enum_do_CC2650_fw_update_retcode_ERR_CRC_checking_gone_bad;
				syslog(LOG_ERR, "The CRC are different: file is 0x%X, device gives 0x%X", fileCrc, devCrc);
			}
		}
		if (r == enum_do_CC2650_fw_update_retcode_OK)
		{
			if(pDevice->reset() != SBL_SUCCESS)
			{
				r = enum_do_CC2650_fw_update_retcode_ERR_chip_reset_gone_bad;
				syslog(LOG_ERR, "ERR_chip_reset_gone_bad");
			}
		}

		pDevice->CloseSerialPort();

		// removes the reset from the CC2650
		if (!is_OK_do_CC2650_reset(0))
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_reset_the_chip_in_normal_mode;
			syslog(LOG_ERR, "ERR_unable_to_reset_the_chip_in_normal_mode");
		}
	}
	if (pvWrite)
	{
		free(pvWrite);
		pvWrite = NULL;
	}
	if (file)
	{
		fclose(file);
		file = NULL;
	}
	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		syslog(LOG_INFO, "Procedure ends OK");
	}
	else
	{
		syslog(LOG_ERR, "Procedure ends with error: %u", (uint32_t)r);
	}
	syslog(LOG_INFO, "%s - ends", __func__);
	
	return r;
}


#ifndef OLINUXINO_LIB
// Syntax:
// <input binary firmware file path>, <major firmware version number>, <middle...>, <minor...>
// <major>, <middle> and <minor> must be numbers between 0 and 255
// creates an output file named "ASACZ_CC2650fw.<major>_<middle>_<minor> that contains
// an header filled with all of the informations (magic key, CRC etc) needed to do a safe update of a CC2650 firmware
// for ASACZ application

typedef enum
{
	enum_ASACZ_CC2650fw_retcode_OK = 0,
	enum_ASACZ_CC2650fw_retcode_ERR_incorrect_number_of_arguments,
	enum_ASACZ_CC2650fw_retcode_ERR_unknown_fw_type,
	enum_ASACZ_CC2650fw_retcode_ERR_incorrect_firmware_version_number_major,
	enum_ASACZ_CC2650fw_retcode_ERR_incorrect_firmware_version_number_middle,
	enum_ASACZ_CC2650fw_retcode_ERR_incorrect_firmware_version_number_minor,
	enum_ASACZ_CC2650fw_retcode_ERR_unable_to_open_input_file,
	enum_ASACZ_CC2650fw_retcode_ERR_unable_to_seek_end_input_file,
	enum_ASACZ_CC2650fw_retcode_ERR_unable_to_get_input_file_size,
	enum_ASACZ_CC2650fw_retcode_ERR_unable_to_seek_begin_input_file,
	enum_ASACZ_CC2650fw_retcode_ERR_invalid_file_size,
	enum_ASACZ_CC2650fw_retcode_ERR_unable_to_alloc_input_file_body_buffer,
	enum_ASACZ_CC2650fw_retcode_ERR_unable_to_read_input_file_body,
	enum_ASACZ_CC2650fw_retcode_ERR_close_input_file,
	enum_ASACZ_CC2650fw_retcode_ERR_magic_name_too_long,
	enum_ASACZ_CC2650fw_retcode_ERR_unable_to_sprint_ascii_fw_type,
	enum_ASACZ_CC2650fw_retcode_ERR_unable_to_sprint_ascii_version_number,
	enum_ASACZ_CC2650fw_retcode_ERR_unable_to_sprint_date,
	enum_ASACZ_CC2650fw_retcode_ERR_unable_to_sprint_output_filename,
	enum_ASACZ_CC2650fw_retcode_ERR_unable_to_open_output_file,
	enum_ASACZ_CC2650fw_retcode_ERR_unable_to_write_header,
	enum_ASACZ_CC2650fw_retcode_ERR_unable_to_write_body,
	enum_ASACZ_CC2650fw_retcode_ERR_unable_to_close_output_file,

	enum_ASACZ_CC2650fw_retcode_numof
}enum_ASACZ_CC2650fw_retcode;

// recognized firmware types, please put printable plain normal characters here, avoid blanks etc
const char *fw_types_OK[]=
{
	"COORDINATOR","ROUTER","END_DEVICE"
};

int main(int argc, char *argv[])
{
	enum_ASACZ_CC2650fw_retcode r = enum_ASACZ_CC2650fw_retcode_OK;
	char *filename_in = NULL;
	char *fw_type_in = NULL;
	uint32_t fw_type = 0;
	if (r == enum_ASACZ_CC2650fw_retcode_OK)
	{
		if (argc < 6)
		{
			r = enum_ASACZ_CC2650fw_retcode_ERR_incorrect_number_of_arguments;
		}
	}
	uint8_t fw_numbers[3];
	memset(fw_numbers, 0, sizeof(fw_numbers));
	if (r == enum_ASACZ_CC2650fw_retcode_OK)
	{
		filename_in = argv[1];
		fw_type_in = argv[2];
		unsigned int i;
		unsigned int found_OK = 0;
		for (i = 0; !found_OK && i < sizeof(fw_types_OK)/sizeof(fw_types_OK[0]); i++)
		{
			if (strcmp(fw_types_OK[i], fw_type_in) == 0)
			{
				fw_type = i;
				found_OK = 1;
				break;
			}
		}
		if (!found_OK)
		{
			r = enum_ASACZ_CC2650fw_retcode_ERR_unknown_fw_type;
		}
	}

	if (r == enum_ASACZ_CC2650fw_retcode_OK)
	{
		unsigned int i;
		for (i = 0; i < 3; i++)
		{
			char * endptr;
			long int n = strtol(argv[3 + i], &endptr, 0);
			if ((*endptr != 0) || (n < 0) || (n > 255))
			{
				r = (enum_ASACZ_CC2650fw_retcode)(enum_ASACZ_CC2650fw_retcode_ERR_incorrect_firmware_version_number_major + i);
				break;
			}
			fw_numbers[i] = n;
		}
	}
	FILE *fin = NULL;
	FILE *fout = NULL;
	if (r == enum_ASACZ_CC2650fw_retcode_OK)
	{
		fin = fopen(filename_in, "rb");
		if (!fin)
		{
			r = enum_ASACZ_CC2650fw_retcode_ERR_unable_to_open_input_file;
		}
	}
	if (r == enum_ASACZ_CC2650fw_retcode_OK)
	{
		int result = fseek(fin, 0L, SEEK_END);
		if (result)
		{
			r = enum_ASACZ_CC2650fw_retcode_ERR_unable_to_seek_end_input_file;
		}
	}
	long l_filesize = 0;
	if (r == enum_ASACZ_CC2650fw_retcode_OK)
	{
		l_filesize = ftell(fin);
		if (l_filesize < 0)
		{
			r = enum_ASACZ_CC2650fw_retcode_ERR_unable_to_get_input_file_size;
		}
		else if (l_filesize > 128 * 1024)
		{
			r = enum_ASACZ_CC2650fw_retcode_ERR_invalid_file_size;
		}
	}
	if (r == enum_ASACZ_CC2650fw_retcode_OK)
	{
		int result = fseek(fin, 0L, SEEK_SET);
		if (result)
		{
			r = enum_ASACZ_CC2650fw_retcode_ERR_unable_to_seek_begin_input_file;
		}
	}
	uint8_t * p_bin_file_body = NULL;
	if (r == enum_ASACZ_CC2650fw_retcode_OK)
	{
		p_bin_file_body = (uint8_t *)malloc(l_filesize);
		if (!p_bin_file_body)
		{
			r = enum_ASACZ_CC2650fw_retcode_ERR_unable_to_alloc_input_file_body_buffer;
		}
		else
		{
			memset(p_bin_file_body, 0, l_filesize);
		}
	}
	if (r == enum_ASACZ_CC2650fw_retcode_OK)
	{
		size_t n_read = fread(p_bin_file_body, l_filesize, 1, fin);
		if (n_read != 1)
		{
			r = enum_ASACZ_CC2650fw_retcode_ERR_unable_to_read_input_file_body;
		}
	}
	if (fin)
	{
		if (fclose(fin))
		{
			if (r == enum_ASACZ_CC2650fw_retcode_OK)
			{
				r = enum_ASACZ_CC2650fw_retcode_ERR_close_input_file;
			}
		}
	}
	type_ASACZ_CC2650_fw_update_header ASACZ_CC2650_fw_update_header = {0};
	if (r == enum_ASACZ_CC2650fw_retcode_OK)
	{
		int n_needed = snprintf((char*)ASACZ_CC2650_fw_update_header.magic_name, sizeof(ASACZ_CC2650_fw_update_header.magic_name), "%s", def_magic_name_ASACZ_CC2650_fw_update_header);
		if (n_needed >= (int)sizeof(ASACZ_CC2650_fw_update_header.magic_name))
		{
			r = enum_ASACZ_CC2650fw_retcode_ERR_magic_name_too_long;
		}
	}
	if (r == enum_ASACZ_CC2650fw_retcode_OK)
	{
		ASACZ_CC2650_fw_update_header.fw_type = fw_type;
		int n = snprintf((char *)ASACZ_CC2650_fw_update_header.ascii_fw_type, sizeof(ASACZ_CC2650_fw_update_header.ascii_fw_type), "%s",
				fw_types_OK[ASACZ_CC2650_fw_update_header.fw_type]
				);
		if (n >= (int)sizeof(ASACZ_CC2650_fw_update_header.ascii_fw_type))
		{
			r = enum_ASACZ_CC2650fw_retcode_ERR_unable_to_sprint_ascii_fw_type;
		}
	}
	if (r == enum_ASACZ_CC2650fw_retcode_OK)
	{
		ASACZ_CC2650_fw_update_header.firmware_body_size = l_filesize;
		ASACZ_CC2650_fw_update_header.fw_version_major = fw_numbers[0];
		ASACZ_CC2650_fw_update_header.fw_version_middle = fw_numbers[1];
		ASACZ_CC2650_fw_update_header.fw_version_minor = fw_numbers[2];
		ASACZ_CC2650_fw_update_header.firmware_body_CRC32_CC2650 = calcCrcLikeChip((const unsigned char *)p_bin_file_body, ASACZ_CC2650_fw_update_header.firmware_body_size);

